run/tInterThermo/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    ymax
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10;
        startFace       82;
    }
    xmin
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8;
        startFace       92;
    }
    xmax
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8;
        startFace       100;
    }
    ymin
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10;
        startFace       108;
    }
    zmin
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       118;
    }
    zmax
    {
        type            patch;
        nFaces          20;
        startFace       138;
    }
)

// ************************************************************************* //
