run/tInterThermo/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interThermoFoam;

startFrom       startTime;

startTime       0;

stopAt          nextWrite;

endTime         1e-3;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   1e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;
maxDi           50000.0;

maxDeltaT       1e-5;


// ************************************************************************* //

functions
{
    /*
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   1;
        probeLocations
        (
            (7.51e-4 2.51e-4 -1.01e-4)
            (7.51e-4 2.51e-4 -1.10e-5)
        );
        fixedLocations  true;
        fields (T);
    }
    */

    maxValue
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        log             true;
        writeControl    writeTime;
        writeFields     false;
        regionType      all;
        operation       maxMag;

        fields (p_rgh U T);
    }
    
    /*
    residuals
    {
        type            residuals;
        libs            ("libutilityFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        log             true;
        fields (p_rgh T);
    }
    */
}
