run/tInterThermo/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.steel.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;

        MULESCorr       yes;
        nLimiterIter    5;
        alphaApplyPrevCorr no;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }

    /*
    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-08;
        relTol          0.01;
        cacheAgglomeration yes;
        maxIter         100;

        //mergeLevels     1;
        //agglomerator    faceAreaPair;
        //nCellsInCoarsestLevel 10;
        //nPostSweeps     4;
        //directSolveCoarset false;
    }
    */
    
    p_rgh 
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-07;
            relTol          0;
            nVcycles        2;
            smoother        GaussSeidel;
        }
        tolerance       1e-08;
        relTol          0.01;
        maxIter         100;
    }  
    
    /*
    p_rgh 
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.01;
    }
    */

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
    
    "pcorr.*"
    {
        $p_rghFinal;
    }
    
    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0;
    }
    
    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }

    TFinal
    {
        $T;
        relTol          0.0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors 1;
    
    T0  300.0;
}

/*
relaxationFactors
{
    equations
    {
        p_rgh 0.7;
    }
}
*/

// ************************************************************************* //
